{"link": "http://www.machinalis.com/blog/machine-learning-and-small-problems/", "data": {"description": "Хорошая статья и код на github о применении машинного обучения для домашних целей", "language": "en", "title": "Машинное обучение и небольшие проблемы", "label": true, "article": "<html><body><div><section class=\"the_post\">\n    <p>If you are interested in machine learning and live in planet Earth, you have probably seen a lot of articles (<a target=\"_blank\" href=\"http://googleblog.blogspot.com.ar/2014/07/google-cloud-platform-predicts-world.html\">example</a>) in the news about machine learning algorithms predicting the outcomes of the FIFA World Cup. Most of them were about big companies (from Google to Reuters) implementing complex systems (mostly deep learners) based in huge data sets, which is almost the best scenario for this kind of work. They have a big chunk of data, and the huge computing power to process it using large sized neural networks. And the results were impressive.</p>\n<p>But not all machine learning happens in that kind of scenarios. Sometimes, you have very sparse data, and your “datacenter” is just your laptop right there, in your lap. Those constraints will surely limit what can be done, but they shouldn’t rule out the possibility of using machine learning for your own benefit, or the benefit of others.</p>\n<p>This article will show you a very simple example of that.</p>\n<p>(at the end, links to the actual code and data)</p>\n<div class=\"section\" id=\"scenario\">\n<h2>Scenario</h2>\n<p>The specific scenario was this:</p>\n<ul class=\"simple\">\n<li>I don’t know anything about football (soccer).</li>\n<li>I also know nothing about cooking. Last time I tried to cook 1 full cup of rice in a 500cc pan.</li>\n<li>My girlfriend’s family organized a contest in which each family member should predict the outcomes of the World Cup matches (first stage only).</li>\n<li>The loser (the one with the worst predictions) would have to cook for the whole family.</li>\n<li>The participation in the contest was mandatory.</li>\n</ul>\n<p>I may know nothing about football and cooking, but I know a little bit about programming and machine learning, so I quickly devised a plan to escape this dire situation. Not to win the contest, but just to be sure I wouldn’t lose and have to cook.</p>\n<p>It should be possible to predict the outcomes of the matches using simple machine learning algorithms and some basic public data about past matches, with a reasonable level of precision, at least better than the other football-illiterate family members.</p>\n</div>\n<div class=\"section\" id=\"the-data\">\n<h2>The Data</h2>\n<p>Wikipedia has entries for every World Cup since the beginning of time (1930), detailing each played match and the outcome. Using this I was able to build a dataset with this structure:</p>\n<blockquote>\n<p>(year, team1, team2, outcome),</p>\n<p>(year, team1, team2, outcome),</p>\n<p>(year, team1, team2, outcome),</p>\n<p>...</p>\n</blockquote>\n<p>But for most of the simpler algorithms, we can’t feed them team names, we must transform them to numbers, and numbers from which some kind of knowledge can be obtained, numbers that could be somewhat related to the match outcomes.</p>\n<p>So based in the full history of matches, I calculated some basic stats for each team, like number of played matches, % of matches won, number of cups won, average podium score, etc. Then replaced “team1” and “team2” with the stats of both teams, obtaining something like this:</p>\n<blockquote>\n<p>(year, team1_stat1, team1_stat2..., team2_stat1, team2_stat2, ..., outcome),</p>\n<p>(year, team1_stat1, team1_stat2..., team2_stat1, team2_stat2, ..., outcome),</p>\n<p>(year, team1_stat1, team1_stat2..., team2_stat1, team2_stat2, ..., outcome),</p>\n<p>...</p>\n</blockquote>\n<p>Finally, I did scaling (otherwise the year was over-influencing the results), and separated training and test sets, to be able to avoid overfitting to the train set by keeping an eye on the test set performance.</p>\n</div>\n<div class=\"section\" id=\"the-learning\">\n<h2>The learning</h2>\n<p>Once I had the datasets ready, it was just matter of creating a <a target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Multilayer_perceptron\">multilayer perceptron</a> (the most common neural network) using the PyBrain library, and then train it using those sets.</p>\n<p>I have some critics to PyBrain’s API (specially in the data sets bits), but it’s fairly easy to use. And the complexity of these computations is something easily done by a common laptop, we don’t need a datacenter to run this training.</p>\n<p>I had to make some compromises to get better results. For example, I decided to only learn and predict winner-loser matches, and not ties. By doing this I knew I would fail at predicting a small percentage of matches (the ties), but I got a far better performance in the winner-loser matches, which yields an overall better prediction performance.</p>\n<p>I experimented with several different network structures, activation functions, and features sets, until I got an acceptable level of prediction accuracy: 75% of winner-loser matches predicted correctly (in both, train and test set).</p>\n<p>75% may sound impressive to some people, and very poor to other, so let me clarify two things:</p>\n<ul class=\"simple\">\n<li>The floor (no knowledge learned) for the performance only looking at winner-loser matches, is 50%, just flipping a coin will predict the correct output half the times.</li>\n<li>The roof for the performance isn’t 100%, as football isn’t entirely predictable based on past matches, it has a random component (at least, knowledge not derivable from past matches results).</li>\n</ul>\n<p>So 75% is “more than halfway through”, from the worst possible, 50%, to the best possible, somewhere below 100%.</p>\n</div>\n<div class=\"section\" id=\"last-minute-complication\">\n<h2>Last minute complication</h2>\n<p>A few hours before the first World Cup match, I was informed that my predictions were incomplete: they lacked the goal counts! (I didn’t know I had to provide them, the rules weren’t clear enough).</p>\n<p>I had a classifier, predicting goals was a task for a regressor, not a classifier. So I did a quick solution: I calculated which was the most common result, and used that for every match: 2 goals for the winner, 1 goal for the loser.</p>\n</div>\n<div class=\"section\" id=\"the-outcome\">\n<h2>The outcome</h2>\n<p>And so the World Cup began, and my neural network predicted the outcomes of the matches, in an epic quest to free me from the punishment of cooking. Remember, I only needed it to be better than the other family members who, as me, didn’t know a lot about football. There were some football fans participating, I didn’t expect to win against them.</p>\n<p>Simultaneously, just for research purposes, I registered and uploaded the predictions to an online contest (<a class=\"reference external\" href=\"http://el-ega.com.ar\">http://el-ega.com.ar</a>), in which about 250 other people were participating (many of them football fans, I presumed).</p>\n<p>The outcome was a surprise: I didn’t just avoid losing, but I won at the family contest (first place), and <strong>also</strong> at the online contest. That simple, small neural network, trained with easily obtainable data from wikipedia, outperformed more than 250 people.</p>\n</div>\n<div class=\"section\" id=\"conclusions\">\n<h2>Conclusions</h2>\n<p>As you can see, you don’t need huge amounts of data, nor giant data centers, to use machine learning to solve real problems with acceptable prediction performance. In this article the example was about football matches, but you could be using these techniques to solve work related problems everyday, maybe outperforming human experts, with tools that are at everybody’s reach.</p>\n<p>Of course you are able to do more when you have the datacenter and big data, but you don’t need to wait for that to start changing the world with the beautiful combination of maths and programming that machine learning is.</p>\n<p>So, tell us your story, which small problems have you solved?</p>\n<p>If you want to hack or learn from it, the full code of the world cup predictor is here:</p>\n<p><a class=\"reference external\" href=\"http://github.com/fisadev/world_cup_learning\">http://github.com/fisadev/world_cup_learning</a></p>\n<p><strong>Want to read more? Follow us on Twitter @machinalis</strong></p>\n</div>\n</section>\n\n\n</div></body></html>", "type": "article"}}
{"link": "http://pypi.python.org/pypi/reloadcmd/", "data": {"description": "", "language": "en", "title": "reloadcmd - Reload command on file changed ", "label": false, "article": "<html><body><div><div id=\"content\">\n\n            \n\n            \n        \n\n\n            <div class=\"section\">\n              <h1>reloadcmd 0.9.0</h1>\n\n              \n\n\n<p>Reload command on file changed</p><p>\n\n\n\n\n\n\n\n\n=========</p><p>reloadcmd</p><p>=========</p><p>Re-executes program when files are changed, moved or deleted</p><p>Usage</p><p>=====</p><p>usage: monitor [-h] [-d DEBUG] [-p PATH] [-e [FILE_EXT [FILE_EXT ...]]] -c</p><p>               COMMAND</p><p>Restarts process when any files / directory changes</p><p>optional arguments:</p><p>  -h, --help            show this help message and exit</p><p>  -d DEBUG, --debug DEBUG</p><p>                        Debug mode</p><p>  -p PATH, --path PATH  Which directory to watch for changes</p><p>  -e [FILE_EXT [FILE_EXT ...]], --extension [FILE_EXT [FILE_EXT ...]]</p><p>                        Which file extensions to listen for</p><p>  -c COMMAND, --command COMMAND</p><p>                        Command to be executed</p><p>``$ reloadcmd --command \"while [ 1 -eq 1 ]; do echo 2; sleep 1; done\"``</p><p>Dependencies</p><p>============</p><p>* `watchdog &lt;https: pypi.python.org=\"\" pypi=\"\" watchdog=\"\"&gt;`</p><p>* `coloredlogs &lt;https: pypi.python.org=\"\" pypi=\"\" coloredlogs=\"\"&gt;`\n\n</p><a name=\"downloads\"> </a>\n\n\n<ul class=\"nodot\">\n  <li><strong>Downloads (All Versions):</strong></li>\n  <li>\n    <span>7</span> downloads in the last day\n  </li>\n  <li>\n    <span>76</span> downloads in the last week\n  </li>\n  <li>\n    <span>251</span> downloads in the last month\n  </li>\n</ul>\n\n\n\n\n\n\n\n\n\n            </div>\n\n\n          </div>\n          </div></body></html>", "type": "article"}}
{"link": "http://alemeshev.blogspot.ru/2014/02/build-app-with-cx-Freeze.html", "data": {"description": "Рецепт получения дистрибутируемого приложения для платформы Windows", "language": "ru", "title": "Собираем поставку приложения используя cx_Freeze", "label": true, "article": "<html><body><div><div class=\"post-body entry-content\" id=\"post-body-2693920742259622657\" itemprop=\"description articleBody\">\n<div dir=\"ltr\" trbidi=\"on\">\n<p>\nКогда я закончил работу над </p><a href=\"http://alemeshev.blogspot.com/2014/02/raspoznaiemtekstnapython.html\" target=\"_blank\">скриптом для распознавания текста</a><p> то столкнулся с неожиданной проблемой. Дело в том что компьютер на котором его планировалось запускать работает под управлением ОС Windows и у оператора нет возможности установить python и необходимые библиотеки. Я столкнулся с таким препятствием впервые так как раньше мои скрипты применялись только на компьютерах с *nix системами, а там поставить все необходимое из репозитория не проблема. Решить вопрос я смог при помощи cx_Freeze. Свой опыт по его использованию я решил изложить в этом небольшом мануале.\n</p><a name=\"more\"/>\n<b>Анамнез</b>\n<b><br/></b><p>\ncx_Freeze это набор скриптов и модулей для сборки поставки приложения из python скриптов. Является прямым конкурентом py2exe и py2app в отличии от них является кросс-платформенным и потенциально способен работать на любой платформе на которой работает сам python.\n</p><p>\nФреймворк опубликован под лицензией </p><a href=\"http://docs.python.org/2/license.html\" target=\"_blank\">PSF</a><p>.\n\n</p><b>Рецепт</b>\n<p>\nПервое что вам потребуется сделать -  установить пакет cx_Freez. Проще всего это можно сделать при помощи pip.</p><p>\nПосле этого, в папке скрипта который должен быть собран, необходимо создать скрипт сценария сборки. По конвенции он может иметь любое имя, я же назвал свой \"setup.py\". Ниже приведен пример скрипта сборки для проекта </p><a href=\"https://github.com/andrey-stekov/sketches/tree/master/python/dummy_ocr\" target=\"_blank\">Dummy OCR</a><p>:\n</p><p>\n\n\nПараметры компиляции могут быть установлены как атрибуты конструктора объекта Executable. Также некоторые из них можно передать через словарь из параметров (в примере build_exe_options). Ниже рассмотрены основные опции компиляции приложения и описание:\n\n</p><table border=\"1\" cellspacing=\"0\">\n<tbody>\n<tr>\n  <td>Название опции</td>\n  <td>Описание</td>\n</tr>\n<tr>\n  <td>script</td>\n  <td>Имя файла скрипта. <span>Нельзя передать через словарь параметров.</span></td>\n</tr>\n<tr>\n  <td>initScript</td>\n  <td>Инициализирующий скрипт. Будет выполнятся перед выполнением основного скрипта. Как правило применяется для конфигурации окружения. <span>Нельзя передать через словарь параметров.</span></td>\n</tr>\n<tr>\n  <td>base</td>\n  <td>Тип приложения. По факту имя исполняемого файла-болванки для целевой платформы который будет использован. Можно задать свой но записав абсолютный путь, иначе путь следует указывать начиная от поддиректории cx_Freeze.<br/>\nДля Windows из коробки поддерживаются следующие варианты: \n  <br/>\n\n<span>Нельзя передать через словарь параметров.\n</span></td>\n</tr>\n<tr>\n  <td>path</td>\n  <td>Список путей где будет проводится поиск. <span>Нельзя передать через словарь параметров.</span></td>\n</tr>\n<tr>\n  <td>targetDir</td>\n  <td>Имя директории с билдом. <span>Нельзя передать через словарь параметров.</span></td>\n</tr>\n<tr>\n  <td>targetName</td>\n  <td>Имя исполняемого файла. <span>Нельзя передать через словарь параметров.</span></td>\n</tr>\n<tr>\n  <td>includes</td>\n  <td>Список модулей включенных в компиляцию.</td>\n</tr>\n<tr>\n  <td>excludes</td>\n  <td>Список модулей исключенных из компиляции.</td>\n</tr>\n<tr>\n  <td>packages</td>\n  <td>Список пакетов включенных в компиляцию.</td>\n</tr>\n<tr>\n  <td>replacePaths</td>\n  <td>Модифицирует имена файлов привязанных к объектам в коде при выводе в tracebacks. Принимает список кортежей состоящих из двух элементов \"путь который следует найти\" и \"путь который следует заменить\". При поиске по ‘*’ обработает директорию содержащую весь пакет за исключением относительного пути к модулю.</td>\n</tr>\n<tr>\n  <td>compress</td>\n  <td>Флаг - сжимать байт-код модулей.</td>\n</tr>\n<tr>\n  <td>copyDependentFiles</td>\n  <td>Флаг - копировать зависимые файлы в сборку.</td>\n</tr>\n<tr>\n  <td>appendScriptToExe</td>\n  <td>Флаг - указывает на необходимость включить скрипт непосредственно в тело исполняемого файла.</td>\n</tr>\n<tr>\n  <td>appendScriptToLibrary</td>\n  <td>Флаг - указывает на необходимость включить скрипт в архив библиотек сборки.</td>\n</tr>\n<tr>\n  <td>icon</td>\n  <td>Имя файла-иконки который должен быть включен в исполняемый файл для Windows приложения, или помещен в директорию сборки для других платформ.</td>\n</tr>\n<tr>\n  <td>namespacePackages</td>\n  <td>Список неймспейс-пакетов (их пути изменены при помощи <a href=\"http://docs.python.org/2/library/pkgutil.html\" target=\"_blank\">pkgutil</a>)</td>\n</tr>\n<tr>\n  <td>shortcutName</td>\n  <td>Имя ярлыка исполняемого файла в случае включения в MSI-пакет.</td>\n</tr>\n<tr>\n  <td>shortcutDir</td>\n  <td>Имя директории в которой будет расположен ярлык после установки MSI-пакета.</td>\n</tr>\n</tbody>\n</table>\n<p>\nПосле создания сборочного скрипта вам достаточно запустить его передав необходимую команду. К примеру:\n\n</p><pre>python setup.py build</pre><p>\nНа данный момент поддерживаются следующие команды:\n\n</p><table border=\"1\" cellspacing=\"0\">\n<tbody>\n<tr>\n  <td>Команда</td>\n  <td>Описание</td>\n</tr>\n<tr>\n  <td>build, build_exe</td>\n  <td>Собрать проект.</td>\n</tr>\n<tr>\n  <td>install, install_exe</td>\n  <td>Собрать набор exe-файлов. Применяется для установки Windows и RPM пакетов.</td>\n</tr>\n<tr>\n  <td>bdist_msi</td>\n  <td>Создать MSI-пакет.</td>\n</tr>\n<tr>\n  <td>bdist_rpm</td>\n  <td>Собрать RPM-пакет.</td>\n</tr>\n<tr>\n  <td>bdist_mac</td>\n  <td>Собрать приложение для Mac OS (.app - директорию).</td>\n</tr>\n<tr>\n  <td>bdist_dmg</td>\n  <td>Собрать DMG-образ диска для инсталляции на Mac OS.</td>\n</tr>\n</tbody>\n</table>\n<p>\nКаждая из этих команд может быть сконфигурированна своим набором параметров. Ознакомится с ними можно на официальном </p><a href=\"http://cx-freeze.readthedocs.org/en/latest/distutils.html#distutils-commands\" target=\"_blank\">сайте</a><p>.\n\n</p><b>Почему не py2exe</b>\n<p>\nPy2exe был отличной утилитой но к сожалению не обновлялся с 2008-го года. Посему я решил попробовать нечто более актуальное. Хотя </p><a href=\"http://www.py2exe.org/index.cgi/Tutorial#Step52\" target=\"_blank\">официальный туториал утверждает</a><p> о наличии поддержки версий языка вплоть до 3.1.\n\n</p><b>Ссылки</b>\n\n<a href=\"http://cx-freeze.readthedocs.org/en/latest/index.html\" target=\"_blank\">Официальный сайт.</a>\n<a href=\"https://bitbucket.org/anthony_tuininga/cx_freeze/src/52b63b329684?at=default\" target=\"_blank\">Репозиторий на BitBucket.</a></div>\n<p/>\n</div>\n</div></body></html>", "type": "article"}}
{"link": "https://www.youtube.com/attribution_link?a=_UzeuPDLeos&u=%2Fwatch%3Fv%3DhIJdFxYlEKE%26feature%3Dshare", "data": {"description": null, "language": "en", "title": "[!] Keynote - Jacob Kaplan-Moss - Pycon 2015 [reddit] ", "label": false, "article": "<html><body><div><div id=\"action-panel-rental-required\" class=\"action-panel-content hid\">\n      <p id=\"watch-actions-rental-required\">\n    <strong>Rating is available when the video has been rented.</strong>\n  </p>\n\n  </div>\n\n  <div id=\"action-panel-error\" class=\"action-panel-content hid\">\n    <p class=\"action-panel-error\">\n      This feature is not available right now. Please try again later.\n    </p>\n  </div>\n\n    </div></body></html>", "type": "article"}}
{"link": "http://pypi.python.org/pypi/pixiv/", "data": {"description": "", "language": "en", "title": "pixiv - Pixiv API client. ", "label": false, "article": "<html><body><div><div class=\"section\">\n              <h1>pixiv 0.1.1</h1>\n\n              \n\n\n<p>Pixiv API client.</p>\n\n\n\n\n\n\n\n\n<a href=\"https://pypi.python.org/pypi/pixiv\" rel=\"nofollow\"><img src=\"https://img.shields.io/pypi/v/pixiv.svg\"/>\n</a>\n<a href=\"https://travis-ci.org/kragniz/python-pixiv\" rel=\"nofollow\"><img src=\"https://img.shields.io/travis/kragniz/python-pixiv.svg\"/>\n</a>\n<a href=\"https://ci.appveyor.com/project/kragniz/pixiv\" rel=\"nofollow\"><img src=\"https://ci.appveyor.com/api/projects/status/github/kragniz/python-pixiv?svg=true\"/></a>\n<a href=\"https://pixiv.readthedocs.org\" rel=\"nofollow\"><img src=\"https://readthedocs.org/projects/pixiv/badge/?version=latest\"/></a>\n<p>python-pixiv: Pixiv API client for moe girls.</p>\n\n<div id=\"quickstart\">\n<h2>Quickstart</h2>\n<p>Install python-pixiv:</p>\n<pre>$ pip install pixiv\n</pre>\n<p>Login to pixiv:</p>\n<pre><span class=\"kn\">from</span> <span class=\"nn\">pixiv</span> <span class=\"kn\">import</span> <span class=\"n\">login</span>\n\n<span class=\"n\">pixiv</span> <span class=\"o\">=</span> <span class=\"n\">login</span><span class=\"p\">(</span><span class=\"s1\">'username'</span><span class=\"p\">,</span> <span class=\"s1\">'password'</span><span class=\"p\">)</span>\n</pre>\n<p>Save the work from a particular user:</p>\n<pre><span class=\"n\">user</span> <span class=\"o\">=</span> <span class=\"n\">pixiv</span><span class=\"o\">.</span><span class=\"n\">user</span><span class=\"p\">(</span><span class=\"mi\">7631951</span><span class=\"p\">)</span>\n\n<span class=\"k\">for</span> <span class=\"n\">art</span> <span class=\"ow\">in</span> <span class=\"n\">user</span><span class=\"o\">.</span><span class=\"n\">works</span><span class=\"p\">():</span>\n    <span class=\"n\">art</span><span class=\"o\">.</span><span class=\"n\">save</span><span class=\"p\">()</span>\n</pre>\n<p>See the <a href=\"https://pixiv.readthedocs.org\" rel=\"nofollow\">full documentation</a> for more!</p>\n</div>\n<p id=\"history\">\n<h2>History</h2>\n</p>\n<div id=\"id1\">\n<h2>0.1.0 (2015-01-20)</h2>\n<ul>\n<li>First release on PyPI.</li>\n<li>Basic things like logging in and viewing a list of works a user has created\nwork.</li>\n</ul>\n</div>\n\n\n<a name=\"downloads\"> </a>\n\n\n<ul class=\"nodot\">\n  <li><strong>Downloads (All Versions):</strong></li>\n  <li>\n    <span>4</span> downloads in the last day\n  </li>\n  <li>\n    <span>96</span> downloads in the last week\n  </li>\n  <li>\n    <span>238</span> downloads in the last month\n  </li>\n</ul>\n\n\n\n\n\n\n\n\n\n            </div>\n\n\n          </div></body></html>", "type": "article"}}
{"link": "https://mail.python.org/pipermail/python-dev/2015-April/139221.html", "data": {"description": null, "language": "en", "title": "[Python-Dev] Type hints -- a mediocre programmer's reaction [reddit] ", "label": false, "article": "<html><body><div><body id=\"readabilityBody\">\n   <h1>[Python-Dev] Type hints -- a mediocre programmer's reaction</h1>\n    <b>Harry Percival</b> \n    <a href=\"mailto:python-dev%40python.org?Subject=Re%3A%20%5BPython-Dev%5D%20Type%20hints%20--%20a%20mediocre%20programmer%27s%20reaction&amp;In-Reply-To=%3CCACFvh98Cp55HpsVJjQBCWJyf9J%3DKeXGAkQP01fCQvt2-BEYkSw%40mail.gmail.com%3E\" title=\"[Python-Dev] Type hints -- a mediocre programmer's reaction\">hjwp2 at cantab.net\n       </a><br/>\n    <i>Mon Apr 20 20:30:39 CEST 2015</i>\n    <p/>\n    <hr/>  \n\n<pre>Hi all,\n\ntldr; type hints in python source are scary. Would reserving them for stub\nfiles be better?\n\nFor people that don't know me (most of you I think), I don't have a long\nexperience of programming (perhaps 5 years, barring a bit of messing about\nwith BASIC in the 80s), I've never made any commits on cPython, and so I\ndon't speak from a great height of experience.  I am very much a \"mediocre\nprogrammer\" (TM).  I wouldn't have felt it appropriate to email python-dev\nabout this, except that one of the members encouraged me to do so --\nperhaps they felt there hadn't been enough \"balance\" in discussions to\ndate.  Also, I've had enough positive reactions in person and on the\ntwitters from people well-known in the Python community, to make me feel\nlike maybe the issue is at least worth discussing...  And I do have some\nexperience with teaching Python to beginners, enough to worry about\nanything I think might make their lives more difficult.\n\nSo, in outline:\n\nI think:\n- type hints are ugly\n- they make the language harder to understand\n- particularly for beginners\n- the defense that \"they're optional\" doesn't really work, for several\nreasons.\n- but maybe there's a way to keep them and their benefits, without\nincurring the above costs\n\n\nMy first reaction to type hints was \"yuck\", and I'm sure I'm not the only\none to think that.  viz (from some pycon slides):\n\n    def zipmap(f: Callable[[int, int], int], xx: List[int],\n               yy: List[int]) -&gt; List[Tuple[int, int, int]]:\n\narg.  and imagine it with default arguments.\n\nOf course, part of this reaction is just a knee-jerk reaction to the new\nand unfamiliar, and should be dismissed, entirely justifiably, as mere\nirrationality.  But I'm sure sensible people agree that they do make our\nfunction definitions longer, more complex, and harder to read.\n\nNo doubt this has occurred to everyone that's been working on them.  There\nis a cost. But the benefits make it worthwhile.\n\nI don't want to spend too long debating the benefits -- Guido gave an\noutline of them at Pycon, and I know y'all wouldn't be doing all this work\nfor no reason.  All I will say is -- it sounds like the people that will\nbenefit are Google and other \"Enterprise\" users, IDE vendors, and the\npeople that will pay for it in sweat and confusion are beginners and John\nQ. Mediocre Programmer.\n\nBut what I really want to dwell on are the costs.\n\n\nI've heard this argument that, because the type hints are optional, they're\nnot something that beginners or the average user needs to worry about.\nBeginners won't need to learn them, and they'll probably never see them.\nAnd average users won't need them either, so they don't need to worry about\nthem either.  So the costs are minimal!  I should relax.\n\nI'm not so sure.  My worry is that once type hinting gets standardised,\nthen they will become a \"best practice\", and there's a particular\npersonality type out there that's going to start wanting to add type hints\nto every function they write.  Similarly to mindlessly obeying PEP8 while\nignoring its intentions, hobgoblin-of-little-minds style, I think we're\nvery likely to see type hints appearing in a lot of python source, or a lot\nof pre-commit-hook checkers.  Pretty soon it will be hard to find any open\nsource library code that doesn't have type hints, or any project style\nguide that doesn't require them.\n\nIt may not even be an irrational, cargo-cult thing -- they really may be\npaying dividends. But it does mean we will all have to wade through a bunch\nof type hints before we can understand any function.  Not the end of the\nworld.  The extra effort may even help us understand our functions better.\nBut it's just that little bit uglier, just that little extra mental effort,\njust that little extra barrier that is going to mean some people, at the\nmargin, just give up on learning programming, or switch to javascript, or\nwhatever it'll be.\n\nNow I'm aware that throwing out type hints altogether is unlikely to be a\npopular proposal at this stage.  So I'm casting around for an alternative.\nAnd it seems to me that stub files might be the answer.\n\n&gt;<i>From what I understand, type hint files are files with the extension .pyi\n</i>that provide stub versions of the functions in the matching .py files, but\nthat contain the type hints, while the .py file doesn't.  In fact they're\nlikely to be a very popular approach anyway, since they allow type hints\nfor codebases that need to work under both 2 and 3.\n\nThat sounds like the best of both worlds to me.\n- .py files stay beautiful, concise, and easy to read.\n- beginners don't have to worry about wading through type definitions when\nthey find themselves browsing someone else's source\n- type information is available to the linters and static file checkers, so\nwe get all the benefits.\n\nSounds great right?  Everybody will be happy!  So let's nail it down! If I\nwas in charge, here's what I'd do:\n\n* standardise the syntax for type hints in 3.5, as per PEP484\n* but: recommend the use of stub files as the preferred place to store hints\n* and: deprecate function annotations in the core language\n* remove them from the core language altogether in 3.6\n\nHow about that?\n\nHP\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: &lt;<a href=\"http://mail.python.org/pipermail/python-dev/attachments/20150420/fdffacd4/attachment.html\">http://mail.python.org/pipermail/python-dev/attachments/20150420/fdffacd4/attachment.html</a>&gt;\n</pre>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    <hr/>\n    <p/>\n\n<hr/>\n<a href=\"https://mail.python.org/mailman/listinfo/python-dev\">More information about the Python-Dev\nmailing list</a><br/>\n</body></div></body></html>", "type": "article"}}
{"link": "http://pypi.python.org/pypi/structio/", "data": {"description": "", "language": "en", "title": "structio - Convenient, readable, struct-based stream I/O ", "label": false, "article": "<body id=\"readabilityBody\">\n     \n\n      \n      <h1 id=\"logoheader\">\n       <a accesskey=\"1\" href=\"http://www.python.org\" id=\"logolink\">\n          <img src=\"/static/images/python-logo.png\" alt=\"homepage\" border=\"0\" id=\"logo\"/>\n       </a>\n      </h1>\n      \n      \n      \n      \n\n      \n      \n      <div id=\"content-body\">\n        <div id=\"body-main\">\n          <div id=\"content\">\n\n            \n\n            \n        \n\n\n            <div class=\"section\">\n              <h1>structio 1.0.0</h1>\n\n              \n\n\n<p>Convenient, readable, struct-based stream I/O</p>\n\n\n\n\n\n\n\n\n\n\n<a name=\"downloads\"> </a>\n\n\n<ul class=\"nodot\">\n  <li><strong>Downloads (All Versions):</strong></li>\n  <li>\n    <span>6</span> downloads in the last day\n  </li>\n  <li>\n    <span>197</span> downloads in the last week\n  </li>\n  <li>\n    <span>197</span> downloads in the last month\n  </li>\n</ul>\n\n\n\n\n\n\n\n\n\n            </div>\n\n\n          </div>\n          \n        </div>\n      </div>\n\n      \n      \n      \n\n      \n      \n\n    </body>\n  ", "type": "article"}}
